{
  "main": {
    "name": "Nafis Khan",
    "occupation": "Android Development TA & Technical Interview Prep Mentor @CodePath Computer Science Student @CCNY Graduating Spring 2023",
    "description": "I moved to the U.S from Bangladesh in 2017 to pursue a better education. My passion for technology and engineering has led me to studying Computer Science. I am very active and have been pursuing all my goals since I moved and I am currently looking for Software Engineering Internships for Summer 2022",
    "image": "profilepic.jpg",
    "bio": "I started my development journey by learning to create Android Apps and then started to teach myself a little bit of Web development. I'm currently working on some Android Projects and will then move on to creating Web counterparts to those projects in the future. My goal is to become a really good and flexible software engineer therefore I'n very open to learning any new technology if an opportunity is given to me.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "nafisrizwank@gmail.com",
    "phone": "555-555-5555",
    "address": {
      "street": "(Your Street)",
      "city": "New York",
      "state": "New York",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "http://timbakerdev.com",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/nafisrk",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/nafis_rk",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/nafisrk/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/nafis_rk/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/nafisK",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Skills represent my comfortability with the following technologies.",
    "education": [
      {
        "school": "The City College Of New York",
        "degree": "Bachelors Of Science In Computer Science",
        "graduated": "Spring 2023",
        "description": "I transferred to The City College of New York for their amazing Engineering & Computer Science Department. I am a junior and I am currently doing my Bachelors in Science in Computer Science. I am also thinking about doing my minor in Economics. At CCNY, I learned a lot of practical knowledge about developing software from the ground up and about processes that take place in both the Academic and Industry worlds to make things work. I discovered my passion for teaching myself things here for taking my projects to the next level by always aiming to do better."
      },
      {
        "school": "The Borough of Manhattan Community College",
        "degree": "Associates In Science In Computer Science",
        "graduated": "Spring 2020",
        "description": "I attended BMCC for my first 2 years of College. While here, I studied Computer Science, and worked hard to be on top of majority of my classes. I received a lot of the theory behind computer science here which helped build the foundation for the projects that I do now. "
      }
    ],
    "work": [
      {
        "company": "CodePath",
        "title": "Android Development TA",
        "years": "August 2021 - Present",
        "description": "• Taught Android development via implementations of apps like Flixter, Twitter, Instagram, and a final group project. • Monitored a time-sensitive live support channel on slack to provide students with guidance on assignments. • Resolved git issues & bugs using Android Studio’s logging and debugging tools. • Had one-on-one zoom sessions with students to explain concepts as well as debug projects."
      },
      {
        "company": "Facebook",
        "title": "FBU Android Development Intern Lead",
        "years": "June 2021 - August 2021",
        "description": "• Collaborated with a team of 15 to support all 180 FBU interns by debugging projects and explaining concepts in a fast-paced but stress-free environment. • Mentored and Supported a Personal Team of 15 Interns completely new to Android Development. • Researched and wrote guides on fixing common issues while developing Android Apps. • Built multiple Android Apps to solidify Android Development concepts and teach FBU Interns."
      },
      {
        "company": "Research Foundation of The City University of New York",
        "title": "Computer Science and Computer Information Systems Tutor",
        "years": "October 2020 - Present",
        "description": "• Taught students the basics of programming from introduction to intermediate courses using C++, Java & python. • Helped students complete their assignments with a complete understanding of the topic. • Provided tutoring services to over 80 unique students."
      }
    ],
    "skills": [
      {
        "name": "Android",
        "level": "90%"
      },
      {
        "name": "ReactJS",
        "level": "50%"
      },
      {
        "name": "Git",
        "level": "80%"
      },
      {
        "name": "HTML, CSS & Bootstrap",
        "level": "70%"
      },
      {
        "name": "MySQL",
        "level": "70%"
      },
      {
        "name": "Firebase",
        "level": "50%"
      },
      {
        "name": "Parse Database",
        "level": "90%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Canadian Wanderlust",
        "category": "My Travel Blog for my post-university travels",
        "image": "canadian-wanderlust.jpg",
        "url": ""
      },
      {
        "title": "Fury Fighting Gear",
        "category": "(offline now) A fighting gear company I started",
        "image": "fury-fighting-gear.jpg",
        "url": ""
      },
      {
        "title": "Original Thai Food",
        "category": "Website I built for a restaurant I like in Thailand",
        "image": "original-thai-food.jpg",
        "url": ""
      },
      {
        "title": "Resume Website",
        "category": "A React based resume website template",
        "image": "resume-website.jpg",
        "url": ""
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
